HCRXchenghong/drive-by-wire-chassis/STM线控控制文件夹/STM32F407_Ackermann_Chassis/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define Throttle_ADC_Pin GPIO_PIN_0
#define Throttle_ADC_GPIO_Port GPIOA
#define Brake_ADC_Pin GPIO_PIN_1
#define Brake_ADC_GPIO_Port GPIOA
#define Ext_UART_TX_Pin GPIO_PIN_2
#define Ext_UART_TX_GPIO_Port GPIOA
#define Ext_UART_RX_Pin GPIO_PIN_3
#define Ext_UART_RX_GPIO_Port GPIOA
#define Gear_Mode_In_Pin GPIO_PIN_10
#define Gear_Mode_In_GPIO_Port GPIOB
#define HW_ESTOP_In_Pin GPIO_PIN_11
#define HW_ESTOP_In_GPIO_Port GPIOB
#define Steer_CAN2_RX_Pin GPIO_PIN_12
#define Steer_CAN2_RX_GPIO_Port GPIOB
#define Steer_CAN2_TX_Pin GPIO_PIN_13
#define Steer_CAN2_TX_GPIO_Port GPIOB
#define EWM22_TX_Pin GPIO_PIN_9
#define EWM22_TX_GPIO_Port GPIOA
#define EWM22_RX_Pin GPIO_PIN_10
#define EWM22_RX_GPIO_Port GPIOA
#define USB_FS_DM_Pin GPIO_PIN_11
#define USB_FS_DM_GPIO_Port GPIOA
#define USB_FS_DP_Pin GPIO_PIN_12
#define USB_FS_DP_GPIO_Port GPIOA
#define Drive_CAN1_RX_Pin GPIO_PIN_8
#define Drive_CAN1_RX_GPIO_Port GPIOB
#define Drive_CAN1_TX_Pin GPIO_PIN_9
#define Drive_CAN1_TX_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
